In [1]:
import pandas as pd
import numpy as np
import psycopg2
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect
from flask import Flask, jsonify
from sqlalchemy import func
from sqlalchemy import Column, JSON, Integer

In [2]:
##DATABASE SET UP
engine = create_engine('postgresql://postgres:Emzy3314@localhost:5432/DogsandCats')

In [3]:
conn = engine.connect()

In [4]:
#latLong = engine.execute('select * from latLong')
latLong_df = pd.read_sql("select * from latLong", conn);
latLong_df.head()

         pets   location  count        lat         lng
0  likes both    alameda    380  37.779872 -122.282185
1  likes both     albany    117  37.886704 -122.297756
2  likes both  amsterdam      1  37.430280 -120.541110
3  likes both    arcadia      1  34.139729 -118.035345
4  likes both   atherton     17  37.461327 -122.197743

In [5]:
jobs_df = pd.read_sql("select * from jobs", conn);
jobs_df.head()

         pets       jobs  count
0  likes both  artistic    2077
1  likes cats  artistic     274
2  likes dogs  artistic     829
3       other  artistic      16
4  likes both   banking     644

In [6]:
signs_df = pd.read_sql("select * from starsigns", conn);
signs_df.head()

       sign        pets  count
0  aquarius  likes both   1640
1  aquarius  likes cats    173
2  aquarius  likes dogs    946
3  aquarius       other     25
4     aries  likes both   1691